ДипломнаяБаза/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПланОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДипломнаяБаза/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Таблица = ПолучитьИзВременногоХранилища(Параметры.ПолучаемыйПараметр);
		
	ГрафикДиаграмма.Очистить();
	//ГрафикДиаграмма.ОбластьЗаголовка.Текст = "График отпуска сотрудников"; 
		
	Серия = ГрафикДиаграмма.УстановитьСерию("Отпуск");
	Серия.Цвет = WebЦвета.ГрифельноСерый; 
	//ГрафикДиаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
			
	Для Каждого Строка Из Таблица Цикл  
		Точка = ГрафикДиаграмма.УстановитьТочку(Строка.Сотрудник);
		ЗначениеДиаграммы = ГрафикДиаграмма.ПолучитьЗначение(Точка,Серия); 
		ЗначениеДиаграммы.Данные.Продолжительность = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24);
		Интервал = ЗначениеДиаграммы.Добавить(); 
		Интервал.Текст = СтрШаблон("Отпуск работника %1", Строка.Сотрудник);
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
